info_prom = [
    (1, 'ДонГаз', 'ул. Королева 13', 2, 40, 65472, 100000, 11_12_22),
    (2, 'УГМК', 'ул. Мира 22', 4, 30, 65472, 1035000, 24_05_16 ),
    (3, 'Евросеть', 'ул. Центральная 75', 3, 25, 65472, 108300,  22_08_20 ),
    (4, 'Еврохим', 'ул. Советская 43', 6, 20, 65472, 1048500,  25_03_18 ),
    (5, 'РосТранс', 'ул. Янтарная 90', 5, 50, 65472, 365000,  11_07_19 ),
    (6, 'Трансстрой', 'ул. Садовая 66', 9, 55, 65472, 184000,  27_12_21 ),
    (7, 'ДонЭнерго', 'ул. Победы 9', 8, 47, 65472, 9340000,  26_02_13 ),
    (8, 'РусАгро', 'ул. Ленина 10', 7, 38, 65472, 147000,  16_01_16 ),
    (9, 'РусЭнерг', 'ул. Школьная 73', 2, 29, 65472, 730000,  19_09_18 ),
    (10, 'АвтоДор', 'ул. Тверская 50', 1, 26, 65472, 82000,  28_04_11 )
]